[
  {
    "id": 1,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://pathakshamabesh.com/wp-content/uploads/2022/02/4084a0711c388099e55c08e2c0f28a25.jpg",
    "rating": 4.5,
    "review": "Harper Lee's 'To Kill a Mockingbird' is a poignant exploration of racial injustice and moral growth in the American South. Through the innocent eyes of Scout Finch, readers witness the courage and integrity of her father, Atticus, as he defends a black man falsely accused of rape. Lee's narrative is both timeless and timely, shedding light on issues that continue to plague society. With its compelling characters and powerful themes, this classic novel remains as relevant today as it was upon its publication.",
    "tags": ["classic", "fiction", "social issues"],
    "page": 324,
    "publisher": "J. B. Lippincott & Co.",
    "publishYear": 1960,
    "category": "Literature"
  },
  {
    "id": 2,
    "title": "George Orwell's",
    "author": "George Orwell",
    "image": "https://www.orwellfoundation.com/wp-content/uploads/2010/09/4.jpg",
    "rating": 4.8,
    "review": "George Orwell's '1984' is a chilling dystopian masterpiece that serves as a stark warning against totalitarianism and the erosion of individual freedoms. Set in a society ruled by the omnipresent Big Brother, Orwell's narrative follows the journey of Winston Smith as he rebels against the oppressive regime. Through its vivid portrayal of surveillance, propaganda, and thought control, '1984' remains a prescient commentary on the dangers of unchecked government power. Orwell's prophetic vision continues to resonate with readers, reminding us of the importance of safeguarding our liberties.",
    "tags": ["dystopian", "fiction", "political"],
    "page": 328,
    "publisher": "Secker & Warburg",
    "publishYear": 1949,
    "category": "Literature"
  },
  {
    "id": 3,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://images2.penguinrandomhouse.com/cover/9780593311844",
    "rating": 4.6,
    "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a timeless tale of love, longing, and the pursuit of the elusive American Dream. Set against the backdrop of the Jazz Age, Fitzgerald's lyrical prose captures the glamour and excess of 1920s New York. Through the enigmatic figure of Jay Gatsby, readers are drawn into a world of opulence and illusion, where appearances often mask deeper truths. As the story unfolds, themes of class, ambition, and moral decay are explored with subtlety and nuance. 'The Great Gatsby' stands as a testament to Fitzgerald's mastery of storytelling and remains a quintessential work of American literature.",
    "tags": ["classic", "fiction", "romance"],
    "page": 180,
    "publisher": "Charles Scribner's Sons",
    "publishYear": 1925,
    "category": "Literature"
  },
  {
    "id": 4,
    "title": "The Handmaid's Tale",
    "author": "Margaret Atwood",
    "image": "https://m.media-amazon.com/images/I/31zzmiNcUuL._SY445_SX342_.jpg",
    "rating": 4.7,
    "review": "The Handmaid's Tale by Margaret Atwood is a dystopian novel that depicts a future society where women are forced into servitude. The story follows Offred, a woman who is assigned the role of a Handmaid, tasked with bearing children for the ruling class.",
    "tags": ["dystopian", "fiction", "feminism"],
    "page": 349,
    "publisher": "McClelland and Stewart",
    "publishYear": 1985,
    "category": "Science Fiction"
  },
  {
    "id": 5,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://cdn.kobo.com/book-images/b92c31a2-6731-436c-b532-5a3207fec2b6/353/569/90/False/pride-and-prejudice-the-original-1813-edition-a-jane-austen-classic-novel.jpg",
    "rating": 4.7,
    "review": "Jane Austen's 'Pride and Prejudice' is a delightful romantic comedy that continues to enchant readers with its wit and charm. Set in the English countryside, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and social hierarchy. Along the way, Austen weaves a tale of misunderstandings, misjudgments, and ultimately, self-discovery. Through her sharp observations and sparkling dialogue, Austen brings to life a vivid cast of characters who leap off the page with their quirks and foibles. With its timeless themes of love, marriage, and societal expectations, 'Pride and Prejudice' remains a beloved classic that celebrates the enduring power of romance.",
    "tags": ["classic", "fiction", "romance"],
    "page": 432,
    "publisher": "T. Egerton, Whitehall",
    "publishYear": 1813,
    "category": "Literature"
  },
  {
    "id": 6,
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/71k--OLmZKL._SY522_.jpg",
    "rating": 4.9,
    "review": "J.R.R. Tolkien's 'The Hobbit' is an enchanting adventure that transports readers to the fantastical realm of Middle-earth. Bilbo Baggins, a humble hobbit, embarks on a perilous journey to reclaim a lost treasure guarded by the fearsome dragon Smaug. Along the way, he encounters elves, dwarves, wizards, and other mythical creatures, each adding depth and wonder to his epic quest. Tolkien's richly imagined world, populated with vivid landscapes and intricate cultures, captivates the imagination and invites readers to embark on their own hero's journey. 'The Hobbit' is a timeless tale of courage, friendship, and the enduring power of hope that continues to inspire readers of all ages.",
    "tags": ["fantasy", "adventure", "fiction"],
    "page": 310,
    "publisher": "George Allen & Unwin",
    "publishYear": 1937,
    "category": "Literature"
  },
  {
    "id": 7,
    "title": "The Da Vinci",
    "author": "Dan Brown",
    "image": "https://rukminim2.flixcart.com/image/832/832/jp2xoy80/book/0/1/7/the-da-vinci-code-original-imafbeey5dyjxu5h.jpeg?q=70&crop=false",
    "rating": 4.2,
    "review": "A fast-paced thriller that blends art, history, and conspiracy.",
    "tags": ["thriller", "mystery", "fiction"],
    "page": 454,
    "publisher": "Doubleday",
    "publishYear": 2003,
    "category": "Literature"
  },
  {
    "id": 8,
    "title": "Harry Potter",
    "author": "J.K. Rowling",
    "image": "https://www.bookstation.ie/wp-content/uploads/2019/06/Harry-Potter-25-Year.jpg",
    "rating": 4.8,
    "review": "The magical beginning to the beloved Harry Potter series.",
    "tags": ["fantasy", "fiction", "young adult"],
    "page": 320,
    "publisher": "Bloomsbury",
    "publishYear": 1997,
    "category": "Literature"
  },
  {
    "id": 9,
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "image": "https://cdn2.penguin.com.au/covers/400/9781784876258.jpg",
    "rating": 4.9,
    "review": "Brave New World by Aldous Huxley is a dystopian novel that explores themes of social engineering, consumerism, and the loss of individuality. Set in a future where society is controlled by a World State, Huxley's narrative depicts a world where human emotions and experiences are artificially manufactured.",
    "tags": ["dystopian", "fiction", "science fiction"],
    "page": 311,
    "publisher": "Chatto & Windus",
    "publishYear": 1932,
    "category": "Fiction"
  },
  {
    "id": 10,
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://olympialetan.com/cdn/shop/products/CLASSICSBC7_1024x1024.jpg?v=1594995512",
    "rating": 4.4,
    "review": "J.D. Salinger's 'The Catcher in the Rye' is a seminal coming-of-age novel that continues to resonate with readers of all generations. Narrated by the irreverent and disillusioned teenager Holden Caulfield, the story follows his journey through the streets of New York City as he grapples with themes of identity, alienation, and the loss of innocence. Salinger's vivid depiction of adolescent angst and rebellion captures the universal experience of youth confronting the complexities of adulthood. With its candid voice and unflinching portrayal of the human condition, 'The Catcher in the Rye' remains a timeless classic that speaks to the heart of adolescence.",
    "tags": ["fiction", "coming-of-age"],
    "page": 224,
    "publisher": "Little, Brown and Company",
    "publishYear": 1951,
    "category": "Literature"
  }
]
